{
	"extensionName": {
		"message": "Tab Positioner",
		"description": "The name of the extension. Should not be localized, as it is a proper noun. This applies to all other message keys as well."
	},
	"extensionDescription": {
		"message": "Choose where tabs appear, and which tab is focused when others disappear.",
		"description": "The description of the extension."
	},
	"title_settings": {
		"message": "Tab Positioner Settings",
		"description": "Title for both the popup and the options page."
	},
	"status_settings_saved": {
		"message": "Settings saved successfully.",
		"description": "Status message shown when settings are saved."
	},
	"status_input_invalid": {
		"message": "Invalid input.",
		"description": "Status message shown when a setting input is invalid."
	},
	"botton_reset_setting": {
		"message": "Reset to Default",
		"description": "Tooltip for the reset button beside each setting."
	},
	"botton_reset_all": {
		"message": "Reset All to Default",
		"description": "Button label to reset all settings to their default values."
	},
	"summary_advanced_settings": {
		"message": "Advanced Settings",
		"description": "Label for the advanced settings section."
	},
	"label_new_tab_position": {
		"message": "When opening the New Tab page, place it:",
		"description": "Label for the setting that controls where chrome://newtab pages are opened. Should match the context of option_xxx_creation. As short as possible, but still clear."
	},
	"label_foreground_link_position": {
		"message": "When opening a link in the foreground, place it:",
		"description": "Label for the setting that controls where links opened in the foreground are placed. Should match the context of option_xxx_creation. As short as possible, but still clear."
	},
	"label_background_link_position": {
		"message": "When opening a link in the background, place it:",
		"description": "Label for the setting that controls where links opened in the background are placed. Should match the context of option_xxx_creation. As short as possible, but still clear."
	},
	"label_popup_position": {
		"message": "When opening a popup, place it:",
		"description": "Label for the setting that controls where the popup is opened. Should match the context of option_xxx_popup. As short as possible, but still clear."
	},
	"title_popup_position": {
		"message": "⚠️ Experimental feature. If enabled, the extension will open popups using the same rules as links, according to the selected option.",
		"description": "Tooltip for the popup position setting, related to label_foreground_link_position and label_background_link_position."
	},
	"label_after_close_activation": {
		"message": "After closing a tab, focus on:",
		"description": "Label for the setting that controls which tab receives focus after another is closed. Should match the context of option_xxx_activation. As short as possible, but still clear."
	},
	"label__tab_batch_creation_threshold_ms": {
		"message": "Batch tab open threshold (ms):",
		"description": "Input prompt for the time interval (in milliseconds) used to group newly opened tabs. As short as possible, but still clear."
	},
	"title__tab_batch_creation_threshold_ms": {
		"message": "Defines a time window (milliseconds) for batching tab creation. Tabs opened within this time window are treated as one batch, preserving order and groups (e.g., during session restore). Increase this value on slower systems if ordering issues occur.",
		"description": "Tooltip for the tab batch creation threshold setting."
	},
	"label__tab_batch_activation_threshold_ms": {
		"message": "Batch tab close threshold (ms):",
		"description": "Input prompt for the time interval (in milliseconds) used to group tab closures. As short as possible, but still clear."
	},
	"title__tab_batch_activation_threshold_ms": {
		"message": "Defines a time window (milliseconds) for batching tab closures. Tabs closed within this time window are treated as one batch, preventing redundant actions and improving performance. Increase this value on slower systems if needed.",
		"description": "Tooltip for the tab batch closing threshold setting."
	},
	"label__persistent_background": {
		"message": "Keep background Service Worker active",
		"description": "Checkbox label for the persistent background setting. Service Worker is a technical term that should not be localized, as it refers to a specific feature of the extension."
	},
	"title__persistent_background": {
		"message": "Prevents the browser from suspending the extension's Service Worker after about 30 seconds of inactivity, ensuring tab positioning rules are always applied. Try enabling this setting if you experience delays or issues with tab positioning after some time.",
		"description": "Tooltip for the persistent background setting. After about 30 seconds of extension inactivity (i.e., no tab event listeners are triggered), the browser suspends the extension's Service Worker to save resources. This clears all in-memory tab data. The next time a tab event occurs, the extension must restore its state, which can cause a delay or race condition that prevents tab positioning rules from being applied correctly."
	},
	"label__debug_mode": {
		"message": "Enable debug output in the extension console",
		"description": "Checkbox label for the debug mode setting, which enables debug output in the extension console."
	},
	"option_default": {
		"message": "Default Behavior",
		"description": "Option to use the browser's default behavior, or the default behavior of this extension."
	},
	"option_before_active_creation": {
		"message": "Before the Current Tab (Left)",
		"description": "Option to place a new tab immediately before the current tab (left in a horizontal tab strip)."
	},
	"option_after_active_creation": {
		"message": "After the Current Tab (Right)",
		"description": "Option to place a new tab immediately after the current tab (right in a horizontal tab strip)."
	},
	"option_window_first_creation": {
		"message": "At the Beginning",
		"description": "Option to place a new tab at the beginning of the tab strip in the current window."
	},
	"option_window_last_creation": {
		"message": "At the End",
		"description": "Option to place a new tab at the end of the tab strip in the current window."
	},
	"option_new_foreground_tab_popup": {
		"message": "As a New Foreground Tab",
		"description": "Option to open the popup in a new foreground tab."
	},
	"option_new_background_tab_popup": {
		"message": "As a New Background Tab",
		"description": "Option to open the popup in a new background tab."
	},
	"option_new_window_popup": {
		"message": "As a New Window",
		"description": "Option to open the popup in a new window."
	},
	"option_before_removed_activation": {
		"message": "The Tab to the Left",
		"description": "Option to focus the tab immediately before the one that was closed (left in a horizontal tab strip)."
	},
	"option_after_removed_activation": {
		"message": "The Tab to the Right",
		"description": "Option to focus the tab immediately after the one that was closed (right in a horizontal tab strip)."
	},
	"option_window_first_activation": {
		"message": "The First Tab",
		"description": "Option to focus the first tab in the window after closing another."
	},
	"option_window_last_activation": {
		"message": "The Last Tab",
		"description": "Option to focus the last tab in the window after closing another."
	},
	"option_activation_history_activation": {
		"message": "The Previously Focused Tab",
		"description": "Option to return focus to the previously focused tab after closing the current one."
	}
}
